src/main/resources/uml/23-도메인객체와-엔티티객체-분리.puml
@startuml
left to right direction

class OrderClient
package "Application Layer" {
    class OrderService
    class Order
    interface OrderRepository
}
package "Infrastructure Layer" {
    class OrderEntity #pink
    class OrderJpaRepository
}

OrderClient ..> OrderService
OrderService ..> Order
OrderService ..> OrderRepository
OrderRepository ..> Order
OrderRepository <|.d. OrderJpaRepository
OrderJpaRepository ..> Order
OrderJpaRepository ..> OrderEntity
OrderEntity ..> Order
@enduml
